; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l4-t1-p8---int100n150-m25---int100c200---s107---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 level106 level107 level108 level109 level110 level111 level112 level113 level114 level115 level116 level117 level118 level119 level120 level121 level122 level123 level124 level125 level126 - fuellevel
)

(:init
(sum level0 level8 level8)
(sum level0 level9 level9)
(sum level0 level18 level18)
(sum level0 level20 level20)
(sum level0 level23 level23)
(sum level0 level25 level25)
(sum level1 level8 level9)
(sum level1 level9 level10)
(sum level1 level18 level19)
(sum level1 level20 level21)
(sum level1 level23 level24)
(sum level1 level25 level26)
(sum level2 level8 level10)
(sum level2 level9 level11)
(sum level2 level18 level20)
(sum level2 level20 level22)
(sum level2 level23 level25)
(sum level2 level25 level27)
(sum level3 level8 level11)
(sum level3 level9 level12)
(sum level3 level18 level21)
(sum level3 level20 level23)
(sum level3 level23 level26)
(sum level3 level25 level28)
(sum level4 level8 level12)
(sum level4 level9 level13)
(sum level4 level18 level22)
(sum level4 level20 level24)
(sum level4 level23 level27)
(sum level4 level25 level29)
(sum level5 level8 level13)
(sum level5 level9 level14)
(sum level5 level18 level23)
(sum level5 level20 level25)
(sum level5 level23 level28)
(sum level5 level25 level30)
(sum level6 level8 level14)
(sum level6 level9 level15)
(sum level6 level18 level24)
(sum level6 level20 level26)
(sum level6 level23 level29)
(sum level6 level25 level31)
(sum level7 level8 level15)
(sum level7 level9 level16)
(sum level7 level18 level25)
(sum level7 level20 level27)
(sum level7 level23 level30)
(sum level7 level25 level32)
(sum level8 level8 level16)
(sum level8 level9 level17)
(sum level8 level18 level26)
(sum level8 level20 level28)
(sum level8 level23 level31)
(sum level8 level25 level33)
(sum level9 level8 level17)
(sum level9 level9 level18)
(sum level9 level18 level27)
(sum level9 level20 level29)
(sum level9 level23 level32)
(sum level9 level25 level34)
(sum level10 level8 level18)
(sum level10 level9 level19)
(sum level10 level18 level28)
(sum level10 level20 level30)
(sum level10 level23 level33)
(sum level10 level25 level35)
(sum level11 level8 level19)
(sum level11 level9 level20)
(sum level11 level18 level29)
(sum level11 level20 level31)
(sum level11 level23 level34)
(sum level11 level25 level36)
(sum level12 level8 level20)
(sum level12 level9 level21)
(sum level12 level18 level30)
(sum level12 level20 level32)
(sum level12 level23 level35)
(sum level12 level25 level37)
(sum level13 level8 level21)
(sum level13 level9 level22)
(sum level13 level18 level31)
(sum level13 level20 level33)
(sum level13 level23 level36)
(sum level13 level25 level38)
(sum level14 level8 level22)
(sum level14 level9 level23)
(sum level14 level18 level32)
(sum level14 level20 level34)
(sum level14 level23 level37)
(sum level14 level25 level39)
(sum level15 level8 level23)
(sum level15 level9 level24)
(sum level15 level18 level33)
(sum level15 level20 level35)
(sum level15 level23 level38)
(sum level15 level25 level40)
(sum level16 level8 level24)
(sum level16 level9 level25)
(sum level16 level18 level34)
(sum level16 level20 level36)
(sum level16 level23 level39)
(sum level16 level25 level41)
(sum level17 level8 level25)
(sum level17 level9 level26)
(sum level17 level18 level35)
(sum level17 level20 level37)
(sum level17 level23 level40)
(sum level17 level25 level42)
(sum level18 level8 level26)
(sum level18 level9 level27)
(sum level18 level18 level36)
(sum level18 level20 level38)
(sum level18 level23 level41)
(sum level18 level25 level43)
(sum level19 level8 level27)
(sum level19 level9 level28)
(sum level19 level18 level37)
(sum level19 level20 level39)
(sum level19 level23 level42)
(sum level19 level25 level44)
(sum level20 level8 level28)
(sum level20 level9 level29)
(sum level20 level18 level38)
(sum level20 level20 level40)
(sum level20 level23 level43)
(sum level20 level25 level45)
(sum level21 level8 level29)
(sum level21 level9 level30)
(sum level21 level18 level39)
(sum level21 level20 level41)
(sum level21 level23 level44)
(sum level21 level25 level46)
(sum level22 level8 level30)
(sum level22 level9 level31)
(sum level22 level18 level40)
(sum level22 level20 level42)
(sum level22 level23 level45)
(sum level22 level25 level47)
(sum level23 level8 level31)
(sum level23 level9 level32)
(sum level23 level18 level41)
(sum level23 level20 level43)
(sum level23 level23 level46)
(sum level23 level25 level48)
(sum level24 level8 level32)
(sum level24 level9 level33)
(sum level24 level18 level42)
(sum level24 level20 level44)
(sum level24 level23 level47)
(sum level24 level25 level49)
(sum level25 level8 level33)
(sum level25 level9 level34)
(sum level25 level18 level43)
(sum level25 level20 level45)
(sum level25 level23 level48)
(sum level25 level25 level50)
(sum level26 level8 level34)
(sum level26 level9 level35)
(sum level26 level18 level44)
(sum level26 level20 level46)
(sum level26 level23 level49)
(sum level26 level25 level51)
(sum level27 level8 level35)
(sum level27 level9 level36)
(sum level27 level18 level45)
(sum level27 level20 level47)
(sum level27 level23 level50)
(sum level27 level25 level52)
(sum level28 level8 level36)
(sum level28 level9 level37)
(sum level28 level18 level46)
(sum level28 level20 level48)
(sum level28 level23 level51)
(sum level28 level25 level53)
(sum level29 level8 level37)
(sum level29 level9 level38)
(sum level29 level18 level47)
(sum level29 level20 level49)
(sum level29 level23 level52)
(sum level29 level25 level54)
(sum level30 level8 level38)
(sum level30 level9 level39)
(sum level30 level18 level48)
(sum level30 level20 level50)
(sum level30 level23 level53)
(sum level30 level25 level55)
(sum level31 level8 level39)
(sum level31 level9 level40)
(sum level31 level18 level49)
(sum level31 level20 level51)
(sum level31 level23 level54)
(sum level31 level25 level56)
(sum level32 level8 level40)
(sum level32 level9 level41)
(sum level32 level18 level50)
(sum level32 level20 level52)
(sum level32 level23 level55)
(sum level32 level25 level57)
(sum level33 level8 level41)
(sum level33 level9 level42)
(sum level33 level18 level51)
(sum level33 level20 level53)
(sum level33 level23 level56)
(sum level33 level25 level58)
(sum level34 level8 level42)
(sum level34 level9 level43)
(sum level34 level18 level52)
(sum level34 level20 level54)
(sum level34 level23 level57)
(sum level34 level25 level59)
(sum level35 level8 level43)
(sum level35 level9 level44)
(sum level35 level18 level53)
(sum level35 level20 level55)
(sum level35 level23 level58)
(sum level35 level25 level60)
(sum level36 level8 level44)
(sum level36 level9 level45)
(sum level36 level18 level54)
(sum level36 level20 level56)
(sum level36 level23 level59)
(sum level36 level25 level61)
(sum level37 level8 level45)
(sum level37 level9 level46)
(sum level37 level18 level55)
(sum level37 level20 level57)
(sum level37 level23 level60)
(sum level37 level25 level62)
(sum level38 level8 level46)
(sum level38 level9 level47)
(sum level38 level18 level56)
(sum level38 level20 level58)
(sum level38 level23 level61)
(sum level38 level25 level63)
(sum level39 level8 level47)
(sum level39 level9 level48)
(sum level39 level18 level57)
(sum level39 level20 level59)
(sum level39 level23 level62)
(sum level39 level25 level64)
(sum level40 level8 level48)
(sum level40 level9 level49)
(sum level40 level18 level58)
(sum level40 level20 level60)
(sum level40 level23 level63)
(sum level40 level25 level65)
(sum level41 level8 level49)
(sum level41 level9 level50)
(sum level41 level18 level59)
(sum level41 level20 level61)
(sum level41 level23 level64)
(sum level41 level25 level66)
(sum level42 level8 level50)
(sum level42 level9 level51)
(sum level42 level18 level60)
(sum level42 level20 level62)
(sum level42 level23 level65)
(sum level42 level25 level67)
(sum level43 level8 level51)
(sum level43 level9 level52)
(sum level43 level18 level61)
(sum level43 level20 level63)
(sum level43 level23 level66)
(sum level43 level25 level68)
(sum level44 level8 level52)
(sum level44 level9 level53)
(sum level44 level18 level62)
(sum level44 level20 level64)
(sum level44 level23 level67)
(sum level44 level25 level69)
(sum level45 level8 level53)
(sum level45 level9 level54)
(sum level45 level18 level63)
(sum level45 level20 level65)
(sum level45 level23 level68)
(sum level45 level25 level70)
(sum level46 level8 level54)
(sum level46 level9 level55)
(sum level46 level18 level64)
(sum level46 level20 level66)
(sum level46 level23 level69)
(sum level46 level25 level71)
(sum level47 level8 level55)
(sum level47 level9 level56)
(sum level47 level18 level65)
(sum level47 level20 level67)
(sum level47 level23 level70)
(sum level47 level25 level72)
(sum level48 level8 level56)
(sum level48 level9 level57)
(sum level48 level18 level66)
(sum level48 level20 level68)
(sum level48 level23 level71)
(sum level48 level25 level73)
(sum level49 level8 level57)
(sum level49 level9 level58)
(sum level49 level18 level67)
(sum level49 level20 level69)
(sum level49 level23 level72)
(sum level49 level25 level74)
(sum level50 level8 level58)
(sum level50 level9 level59)
(sum level50 level18 level68)
(sum level50 level20 level70)
(sum level50 level23 level73)
(sum level50 level25 level75)
(sum level51 level8 level59)
(sum level51 level9 level60)
(sum level51 level18 level69)
(sum level51 level20 level71)
(sum level51 level23 level74)
(sum level51 level25 level76)
(sum level52 level8 level60)
(sum level52 level9 level61)
(sum level52 level18 level70)
(sum level52 level20 level72)
(sum level52 level23 level75)
(sum level52 level25 level77)
(sum level53 level8 level61)
(sum level53 level9 level62)
(sum level53 level18 level71)
(sum level53 level20 level73)
(sum level53 level23 level76)
(sum level53 level25 level78)
(sum level54 level8 level62)
(sum level54 level9 level63)
(sum level54 level18 level72)
(sum level54 level20 level74)
(sum level54 level23 level77)
(sum level54 level25 level79)
(sum level55 level8 level63)
(sum level55 level9 level64)
(sum level55 level18 level73)
(sum level55 level20 level75)
(sum level55 level23 level78)
(sum level55 level25 level80)
(sum level56 level8 level64)
(sum level56 level9 level65)
(sum level56 level18 level74)
(sum level56 level20 level76)
(sum level56 level23 level79)
(sum level56 level25 level81)
(sum level57 level8 level65)
(sum level57 level9 level66)
(sum level57 level18 level75)
(sum level57 level20 level77)
(sum level57 level23 level80)
(sum level57 level25 level82)
(sum level58 level8 level66)
(sum level58 level9 level67)
(sum level58 level18 level76)
(sum level58 level20 level78)
(sum level58 level23 level81)
(sum level58 level25 level83)
(sum level59 level8 level67)
(sum level59 level9 level68)
(sum level59 level18 level77)
(sum level59 level20 level79)
(sum level59 level23 level82)
(sum level59 level25 level84)
(sum level60 level8 level68)
(sum level60 level9 level69)
(sum level60 level18 level78)
(sum level60 level20 level80)
(sum level60 level23 level83)
(sum level60 level25 level85)
(sum level61 level8 level69)
(sum level61 level9 level70)
(sum level61 level18 level79)
(sum level61 level20 level81)
(sum level61 level23 level84)
(sum level61 level25 level86)
(sum level62 level8 level70)
(sum level62 level9 level71)
(sum level62 level18 level80)
(sum level62 level20 level82)
(sum level62 level23 level85)
(sum level62 level25 level87)
(sum level63 level8 level71)
(sum level63 level9 level72)
(sum level63 level18 level81)
(sum level63 level20 level83)
(sum level63 level23 level86)
(sum level63 level25 level88)
(sum level64 level8 level72)
(sum level64 level9 level73)
(sum level64 level18 level82)
(sum level64 level20 level84)
(sum level64 level23 level87)
(sum level64 level25 level89)
(sum level65 level8 level73)
(sum level65 level9 level74)
(sum level65 level18 level83)
(sum level65 level20 level85)
(sum level65 level23 level88)
(sum level65 level25 level90)
(sum level66 level8 level74)
(sum level66 level9 level75)
(sum level66 level18 level84)
(sum level66 level20 level86)
(sum level66 level23 level89)
(sum level66 level25 level91)
(sum level67 level8 level75)
(sum level67 level9 level76)
(sum level67 level18 level85)
(sum level67 level20 level87)
(sum level67 level23 level90)
(sum level67 level25 level92)
(sum level68 level8 level76)
(sum level68 level9 level77)
(sum level68 level18 level86)
(sum level68 level20 level88)
(sum level68 level23 level91)
(sum level68 level25 level93)
(sum level69 level8 level77)
(sum level69 level9 level78)
(sum level69 level18 level87)
(sum level69 level20 level89)
(sum level69 level23 level92)
(sum level69 level25 level94)
(sum level70 level8 level78)
(sum level70 level9 level79)
(sum level70 level18 level88)
(sum level70 level20 level90)
(sum level70 level23 level93)
(sum level70 level25 level95)
(sum level71 level8 level79)
(sum level71 level9 level80)
(sum level71 level18 level89)
(sum level71 level20 level91)
(sum level71 level23 level94)
(sum level71 level25 level96)
(sum level72 level8 level80)
(sum level72 level9 level81)
(sum level72 level18 level90)
(sum level72 level20 level92)
(sum level72 level23 level95)
(sum level72 level25 level97)
(sum level73 level8 level81)
(sum level73 level9 level82)
(sum level73 level18 level91)
(sum level73 level20 level93)
(sum level73 level23 level96)
(sum level73 level25 level98)
(sum level74 level8 level82)
(sum level74 level9 level83)
(sum level74 level18 level92)
(sum level74 level20 level94)
(sum level74 level23 level97)
(sum level74 level25 level99)
(sum level75 level8 level83)
(sum level75 level9 level84)
(sum level75 level18 level93)
(sum level75 level20 level95)
(sum level75 level23 level98)
(sum level75 level25 level100)
(sum level76 level8 level84)
(sum level76 level9 level85)
(sum level76 level18 level94)
(sum level76 level20 level96)
(sum level76 level23 level99)
(sum level76 level25 level101)
(sum level77 level8 level85)
(sum level77 level9 level86)
(sum level77 level18 level95)
(sum level77 level20 level97)
(sum level77 level23 level100)
(sum level77 level25 level102)
(sum level78 level8 level86)
(sum level78 level9 level87)
(sum level78 level18 level96)
(sum level78 level20 level98)
(sum level78 level23 level101)
(sum level78 level25 level103)
(sum level79 level8 level87)
(sum level79 level9 level88)
(sum level79 level18 level97)
(sum level79 level20 level99)
(sum level79 level23 level102)
(sum level79 level25 level104)
(sum level80 level8 level88)
(sum level80 level9 level89)
(sum level80 level18 level98)
(sum level80 level20 level100)
(sum level80 level23 level103)
(sum level80 level25 level105)
(sum level81 level8 level89)
(sum level81 level9 level90)
(sum level81 level18 level99)
(sum level81 level20 level101)
(sum level81 level23 level104)
(sum level81 level25 level106)
(sum level82 level8 level90)
(sum level82 level9 level91)
(sum level82 level18 level100)
(sum level82 level20 level102)
(sum level82 level23 level105)
(sum level82 level25 level107)
(sum level83 level8 level91)
(sum level83 level9 level92)
(sum level83 level18 level101)
(sum level83 level20 level103)
(sum level83 level23 level106)
(sum level83 level25 level108)
(sum level84 level8 level92)
(sum level84 level9 level93)
(sum level84 level18 level102)
(sum level84 level20 level104)
(sum level84 level23 level107)
(sum level84 level25 level109)
(sum level85 level8 level93)
(sum level85 level9 level94)
(sum level85 level18 level103)
(sum level85 level20 level105)
(sum level85 level23 level108)
(sum level85 level25 level110)
(sum level86 level8 level94)
(sum level86 level9 level95)
(sum level86 level18 level104)
(sum level86 level20 level106)
(sum level86 level23 level109)
(sum level86 level25 level111)
(sum level87 level8 level95)
(sum level87 level9 level96)
(sum level87 level18 level105)
(sum level87 level20 level107)
(sum level87 level23 level110)
(sum level87 level25 level112)
(sum level88 level8 level96)
(sum level88 level9 level97)
(sum level88 level18 level106)
(sum level88 level20 level108)
(sum level88 level23 level111)
(sum level88 level25 level113)
(sum level89 level8 level97)
(sum level89 level9 level98)
(sum level89 level18 level107)
(sum level89 level20 level109)
(sum level89 level23 level112)
(sum level89 level25 level114)
(sum level90 level8 level98)
(sum level90 level9 level99)
(sum level90 level18 level108)
(sum level90 level20 level110)
(sum level90 level23 level113)
(sum level90 level25 level115)
(sum level91 level8 level99)
(sum level91 level9 level100)
(sum level91 level18 level109)
(sum level91 level20 level111)
(sum level91 level23 level114)
(sum level91 level25 level116)
(sum level92 level8 level100)
(sum level92 level9 level101)
(sum level92 level18 level110)
(sum level92 level20 level112)
(sum level92 level23 level115)
(sum level92 level25 level117)
(sum level93 level8 level101)
(sum level93 level9 level102)
(sum level93 level18 level111)
(sum level93 level20 level113)
(sum level93 level23 level116)
(sum level93 level25 level118)
(sum level94 level8 level102)
(sum level94 level9 level103)
(sum level94 level18 level112)
(sum level94 level20 level114)
(sum level94 level23 level117)
(sum level94 level25 level119)
(sum level95 level8 level103)
(sum level95 level9 level104)
(sum level95 level18 level113)
(sum level95 level20 level115)
(sum level95 level23 level118)
(sum level95 level25 level120)
(sum level96 level8 level104)
(sum level96 level9 level105)
(sum level96 level18 level114)
(sum level96 level20 level116)
(sum level96 level23 level119)
(sum level96 level25 level121)
(sum level97 level8 level105)
(sum level97 level9 level106)
(sum level97 level18 level115)
(sum level97 level20 level117)
(sum level97 level23 level120)
(sum level97 level25 level122)
(sum level98 level8 level106)
(sum level98 level9 level107)
(sum level98 level18 level116)
(sum level98 level20 level118)
(sum level98 level23 level121)
(sum level98 level25 level123)
(sum level99 level8 level107)
(sum level99 level9 level108)
(sum level99 level18 level117)
(sum level99 level20 level119)
(sum level99 level23 level122)
(sum level99 level25 level124)
(sum level100 level8 level108)
(sum level100 level9 level109)
(sum level100 level18 level118)
(sum level100 level20 level120)
(sum level100 level23 level123)
(sum level100 level25 level125)
(sum level101 level8 level109)
(sum level101 level9 level110)
(sum level101 level18 level119)
(sum level101 level20 level121)
(sum level101 level23 level124)
(sum level101 level25 level126)
(sum level102 level8 level110)
(sum level102 level9 level111)
(sum level102 level18 level120)
(sum level102 level20 level122)
(sum level102 level23 level125)
(sum level103 level8 level111)
(sum level103 level9 level112)
(sum level103 level18 level121)
(sum level103 level20 level123)
(sum level103 level23 level126)
(sum level104 level8 level112)
(sum level104 level9 level113)
(sum level104 level18 level122)
(sum level104 level20 level124)
(sum level105 level8 level113)
(sum level105 level9 level114)
(sum level105 level18 level123)
(sum level105 level20 level125)
(sum level106 level8 level114)
(sum level106 level9 level115)
(sum level106 level18 level124)
(sum level106 level20 level126)
(sum level107 level8 level115)
(sum level107 level9 level116)
(sum level107 level18 level125)
(sum level108 level8 level116)
(sum level108 level9 level117)
(sum level108 level18 level126)
(sum level109 level8 level117)
(sum level109 level9 level118)
(sum level110 level8 level118)
(sum level110 level9 level119)
(sum level111 level8 level119)
(sum level111 level9 level120)
(sum level112 level8 level120)
(sum level112 level9 level121)
(sum level113 level8 level121)
(sum level113 level9 level122)
(sum level114 level8 level122)
(sum level114 level9 level123)
(sum level115 level8 level123)
(sum level115 level9 level124)
(sum level116 level8 level124)
(sum level116 level9 level125)
(sum level117 level8 level125)
(sum level117 level9 level126)
(sum level118 level8 level126)

(connected l0 l1)
(fuelcost level9 l0 l1)
(connected l0 l2)
(fuelcost level23 l0 l2)
(connected l0 l3)
(fuelcost level18 l0 l3)
(connected l1 l0)
(fuelcost level9 l1 l0)
(connected l1 l2)
(fuelcost level8 l1 l2)
(connected l1 l3)
(fuelcost level20 l1 l3)
(connected l2 l0)
(fuelcost level23 l2 l0)
(connected l2 l1)
(fuelcost level8 l2 l1)
(connected l2 l3)
(fuelcost level25 l2 l3)
(connected l3 l0)
(fuelcost level18 l3 l0)
(connected l3 l1)
(fuelcost level20 l3 l1)
(connected l3 l2)
(fuelcost level25 l3 l2)

(at t0 l3)
(fuel t0 level126)
(= (total-cost) 0)

(at p0 l3)
(at p1 l2)
(at p2 l2)
(at p3 l1)
(at p4 l1)
(at p5 l1)
(at p6 l3)
(at p7 l2)
)

(:goal
(and
(at p0 l1)
(at p1 l3)
(at p2 l3)
(at p3 l2)
(at p4 l3)
(at p5 l2)
(at p6 l2)
(at p7 l0)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p6 t0 l3)
   deleted: (at p6 l3)
   added: (in p6 t0)
   goals met: 0 of 8
2. (load p0 t0 l3)
   deleted: (at p0 l3)
   added: (in p0 t0)
   goals met: 0 of 8
3. (drive t0 l3 l1 level106 level20 level126)
   deleted: (at t0 l3) (fuel t0 level126)
   added: (at t0 l1) (fuel t0 level106)
   goals met: 0 of 8
4. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 1 of 8
5. (load p5 t0 l1)
   deleted: (at p5 l1)
   added: (in p5 t0)
   goals met: 1 of 8
6. (load p4 t0 l1)
   deleted: (at p4 l1)
   added: (in p4 t0)
   goals met: 1 of 8
7. (load p3 t0 l1)
   deleted: (at p3 l1)
   added: (in p3 t0)
   goals met: 1 of 8
8. (drive t0 l1 l2 level98 level8 level106)
   deleted: (at t0 l1) (fuel t0 level106)
   added: (at t0 l2) (fuel t0 level98)
   goals met: 1 of 8
9. (load p7 t0 l2)
   deleted: (at p7 l2)
   added: (in p7 t0)
   goals met: 1 of 8
10. (load p2 t0 l2)
   deleted: (at p2 l2)
   added: (in p2 t0)
   goals met: 1 of 8
11. (load p1 t0 l2)
   deleted: (at p1 l2)
   added: (in p1 t0)
   goals met: 1 of 8
12. (unload p3 t0 l2)
   deleted: (in p3 t0)
   added: (at p3 l2)
   goals met: 2 of 8
13. (unload p5 t0 l2)
   deleted: (in p5 t0)
   added: (at p5 l2)
   goals met: 3 of 8
14. (unload p6 t0 l2)
   deleted: (in p6 t0)
   added: (at p6 l2)
   goals met: 4 of 8
15. (drive t0 l2 l0 level75 level23 level98)
   deleted: (at t0 l2) (fuel t0 level98)
   added: (at t0 l0) (fuel t0 level75)
   goals met: 4 of 8
16. (unload p7 t0 l0)
   deleted: (in p7 t0)
   added: (at p7 l0)
   goals met: 5 of 8
17. (drive t0 l0 l3 level57 level18 level75)
   deleted: (at t0 l0) (fuel t0 level75)
   added: (at t0 l3) (fuel t0 level57)
   goals met: 5 of 8
18. (unload p1 t0 l3)
   deleted: (in p1 t0)
   added: (at p1 l3)
   goals met: 6 of 8
19. (unload p2 t0 l3)
   deleted: (in p2 t0)
   added: (at p2 l3)
   goals met: 7 of 8
20. (unload p4 t0 l3)
   deleted: (in p4 t0)
   added: (at p4 l3)
   goals met: 8 of 8
